outputs/qwen36-35b-a3b-fp8_pro5000_8x72g_input-4k-output-1k_cand32_baseline/results/c030/bench_c52_20260831-035512.log
$ python -m sglang.bench_serving --backend sglang --dataset-name random-ids --random-range-ratio 1.0 --host 127.0.0.1 --port 30001 --model /data/autotune/models/Qwen3.6-35B-A3B-FP8 --dataset-path '' --max-concurrency 52 --random-input-len 4096 --random-output-len 1024 --output-file /workspace/outputs/c030/bench_c52_20260831-035512.jsonl --num-prompts 208
# exit code: 0

----- stdout -----
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30001, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/autotune/models/Qwen3.6-35B-A3B-FP8', served_model_name=None, tokenizer=None, num_prompts=208, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=52, output_file='/workspace/outputs/c030/bench_c52_20260831-035512.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30001/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30001, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/autotune/models/Qwen3.6-35B-A3B-FP8', served_model_name=None, tokenizer=None, num_prompts=208, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=52, output_file='/workspace/outputs/c030/bench_c52_20260831-035512.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 851968
#Output tokens: 212992
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 52        
Successful requests:                     208       
Benchmark duration (s):                  122.52    
Total input tokens:                      851968    
Total input text tokens:                 851968    
Total generated tokens:                  212992    
Total generated tokens (retokenized):    210531    
Request throughput (req/s):              1.70      
Input token throughput (tok/s):          6953.88   
Output token throughput (tok/s):         1738.47   
Peak output token throughput (tok/s):    2708.00   
Peak concurrent requests:                66        
Total token throughput (tok/s):          8692.35   
Concurrency:                             48.60     
Accept length:                           3.60      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   28623.87  
Median E2E Latency (ms):                 26968.84  
P90 E2E Latency (ms):                    35457.09  
P95 E2E Latency (ms):                    37832.21  
P99 E2E Latency (ms):                    50186.68  
---------------Time to First Token----------------
Mean TTFT (ms):                          3798.71   
Median TTFT (ms):                        2206.21   
P90 TTFT (ms):                           6913.81   
P95 TTFT (ms):                           8946.88   
P99 TTFT (ms):                           25495.24  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          24.27     
Median TPOT (ms):                        23.86     
P90 TPOT (ms):                           30.65     
P95 TPOT (ms):                           32.05     
P99 TPOT (ms):                           33.59     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           24.51     
Median ITL (ms):                         17.38     
P90 ITL (ms):                            50.90     
P95 ITL (ms):                            65.13     
P99 ITL (ms):                            96.59     
Max ITL (ms):                            6356.01   
==================================================

----- stderr -----
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(

  0%|          | 0/208 [00:00<?, ?it/s]
  0%|          | 1/208 [00:24<1:24:26, 24.48s/it]
  3%|▎         | 6/208 [00:24<10:21,  3.07s/it]  
  7%|▋         | 15/208 [00:25<03:09,  1.02it/s]
  9%|▊         | 18/208 [00:27<02:50,  1.11it/s]
 10%|▉         | 20/208 [00:27<02:29,  1.26it/s]
 11%|█         | 22/208 [00:28<02:08,  1.45it/s]
 12%|█▏        | 24/208 [00:29<01:50,  1.66it/s]
 12%|█▏        | 25/208 [00:29<01:49,  1.67it/s]
 12%|█▎        | 26/208 [00:30<01:43,  1.75it/s]
 13%|█▎        | 28/208 [00:31<01:36,  1.87it/s]
 14%|█▍        | 29/208 [00:31<01:34,  1.89it/s]
 14%|█▍        | 30/208 [00:32<01:32,  1.92it/s]
 15%|█▍        | 31/208 [00:33<01:57,  1.51it/s]
 15%|█▌        | 32/208 [00:33<01:39,  1.76it/s]
 16%|█▋        | 34/208 [00:34<01:14,  2.33it/s]
 17%|█▋        | 36/208 [00:34<00:55,  3.12it/s]
 18%|█▊        | 37/208 [00:35<01:20,  2.13it/s]
 20%|█▉        | 41/208 [00:35<00:42,  3.96it/s]
 20%|██        | 42/208 [00:36<00:57,  2.90it/s]
 21%|██        | 43/208 [00:36<00:58,  2.83it/s]
 21%|██        | 44/208 [00:37<01:21,  2.00it/s]
 23%|██▎       | 47/208 [00:38<01:06,  2.42it/s]
 23%|██▎       | 48/208 [00:49<06:15,  2.34s/it]
 24%|██▍       | 50/208 [00:49<04:09,  1.58s/it]
 25%|██▌       | 53/208 [00:50<02:28,  1.05it/s]
 26%|██▌       | 54/208 [00:51<02:20,  1.09it/s]
 26%|██▋       | 55/208 [00:51<02:07,  1.20it/s]
 28%|██▊       | 59/208 [00:51<01:06,  2.24it/s]
 29%|██▉       | 60/208 [00:52<01:11,  2.08it/s]
 30%|██▉       | 62/208 [00:53<01:00,  2.42it/s]
 30%|███       | 63/208 [00:53<01:04,  2.25it/s]
 31%|███▏      | 65/208 [00:54<00:57,  2.47it/s]
 32%|███▏      | 66/208 [00:54<00:56,  2.53it/s]
 32%|███▏      | 67/208 [00:55<00:56,  2.49it/s]
 33%|███▎      | 68/208 [00:55<00:54,  2.55it/s]
 34%|███▎      | 70/208 [00:55<00:40,  3.42it/s]
 34%|███▍      | 71/208 [00:56<00:45,  3.02it/s]
 35%|███▌      | 73/208 [00:56<00:40,  3.32it/s]
 36%|███▌      | 74/208 [00:56<00:37,  3.54it/s]
 36%|███▌      | 75/208 [00:57<00:37,  3.51it/s]
 37%|███▋      | 76/208 [00:58<01:06,  1.99it/s]
 37%|███▋      | 77/208 [00:58<01:03,  2.08it/s]
 38%|███▊      | 78/208 [00:59<00:55,  2.36it/s]
 38%|███▊      | 79/208 [00:59<00:57,  2.24it/s]
 38%|███▊      | 80/208 [00:59<00:53,  2.38it/s]
 39%|███▉      | 82/208 [01:00<00:43,  2.90it/s]
 40%|████      | 84/208 [01:01<00:42,  2.93it/s]
 41%|████▏     | 86/208 [01:02<01:00,  2.00it/s]
 42%|████▏     | 88/208 [01:03<00:50,  2.39it/s]
 43%|████▎     | 89/208 [01:03<00:53,  2.24it/s]
 43%|████▎     | 90/208 [01:04<00:59,  1.97it/s]
 44%|████▍     | 91/208 [01:05<01:00,  1.92it/s]
 44%|████▍     | 92/208 [01:06<01:26,  1.35it/s]
 45%|████▍     | 93/208 [01:06<01:13,  1.56it/s]
 45%|████▌     | 94/208 [01:07<01:19,  1.44it/s]
 46%|████▌     | 95/208 [01:09<01:50,  1.03it/s]
 46%|████▌     | 96/208 [01:15<04:25,  2.37s/it]
 47%|████▋     | 97/208 [01:15<03:15,  1.76s/it]
 47%|████▋     | 98/208 [01:15<02:28,  1.35s/it]
 48%|████▊     | 99/208 [01:16<02:01,  1.12s/it]
 49%|████▊     | 101/208 [01:17<01:23,  1.29it/s]
 49%|████▉     | 102/208 [01:17<01:09,  1.53it/s]
 50%|████▉     | 103/208 [01:18<01:10,  1.49it/s]
 50%|█████     | 104/208 [01:19<01:25,  1.22it/s]
 51%|█████     | 106/208 [01:19<00:58,  1.74it/s]
 52%|█████▏    | 108/208 [01:20<00:46,  2.16it/s]
 52%|█████▏    | 109/208 [01:20<00:48,  2.06it/s]
 53%|█████▎    | 110/208 [01:21<00:49,  1.98it/s]
 54%|█████▍    | 112/208 [01:21<00:34,  2.77it/s]
 54%|█████▍    | 113/208 [01:22<00:39,  2.41it/s]
 55%|█████▌    | 115/208 [01:22<00:30,  3.04it/s]
 56%|█████▌    | 116/208 [01:23<00:36,  2.52it/s]
 57%|█████▋    | 118/208 [01:23<00:30,  2.95it/s]
 57%|█████▋    | 119/208 [01:24<00:29,  3.00it/s]
 58%|█████▊    | 121/208 [01:24<00:22,  3.82it/s]
 59%|█████▉    | 123/208 [01:25<00:21,  4.01it/s]
 60%|█████▉    | 124/208 [01:25<00:23,  3.60it/s]
 60%|██████    | 125/208 [01:25<00:24,  3.37it/s]
 61%|██████    | 126/208 [01:26<00:39,  2.09it/s]
 62%|██████▎   | 130/208 [01:27<00:24,  3.19it/s]
 63%|██████▎   | 131/208 [01:28<00:25,  3.07it/s]
 63%|██████▎   | 132/208 [01:28<00:32,  2.36it/s]
 65%|██████▍   | 135/208 [01:30<00:34,  2.09it/s]
 65%|██████▌   | 136/208 [01:31<00:40,  1.77it/s]
 66%|██████▌   | 137/208 [01:32<00:45,  1.55it/s]
 66%|██████▋   | 138/208 [01:32<00:43,  1.59it/s]
 67%|██████▋   | 139/208 [01:34<00:51,  1.35it/s]
 67%|██████▋   | 140/208 [01:34<00:48,  1.41it/s]
 68%|██████▊   | 141/208 [01:36<01:00,  1.10it/s]
 68%|██████▊   | 142/208 [01:36<00:53,  1.24it/s]
 69%|██████▉   | 144/208 [01:40<01:24,  1.32s/it]
 70%|██████▉   | 145/208 [01:40<01:08,  1.09s/it]
 70%|███████   | 146/208 [01:41<01:00,  1.03it/s]
 71%|███████   | 147/208 [01:43<01:16,  1.25s/it]
 71%|███████   | 148/208 [01:43<01:01,  1.02s/it]
 72%|███████▏  | 149/208 [01:44<00:57,  1.03it/s]
 73%|███████▎  | 152/208 [01:45<00:32,  1.73it/s]
 74%|███████▎  | 153/208 [01:46<00:31,  1.77it/s]
 74%|███████▍  | 154/208 [01:46<00:28,  1.88it/s]
 75%|███████▌  | 157/208 [01:47<00:19,  2.56it/s]
 76%|███████▌  | 158/208 [01:47<00:18,  2.72it/s]
 76%|███████▋  | 159/208 [01:47<00:16,  2.95it/s]
 77%|███████▋  | 160/208 [01:47<00:14,  3.23it/s]
 77%|███████▋  | 161/208 [01:48<00:15,  2.94it/s]
 79%|███████▉  | 164/208 [01:48<00:09,  4.48it/s]
 80%|████████  | 167/208 [01:48<00:06,  6.79it/s]
 81%|████████▏ | 169/208 [01:49<00:08,  4.45it/s]
 83%|████████▎ | 172/208 [01:50<00:06,  5.61it/s]
 84%|████████▎ | 174/208 [01:50<00:07,  4.55it/s]
 85%|████████▍ | 176/208 [01:50<00:06,  5.21it/s]
 85%|████████▌ | 177/208 [01:51<00:07,  4.10it/s]
 86%|████████▌ | 178/208 [01:51<00:07,  4.16it/s]
 86%|████████▌ | 179/208 [01:52<00:11,  2.51it/s]
 87%|████████▋ | 180/208 [01:53<00:11,  2.37it/s]
 87%|████████▋ | 181/208 [01:53<00:09,  2.70it/s]
 88%|████████▊ | 183/208 [01:54<00:10,  2.33it/s]
 89%|████████▉ | 185/208 [01:54<00:07,  3.09it/s]
 89%|████████▉ | 186/208 [01:55<00:07,  2.86it/s]
 90%|████████▉ | 187/208 [01:55<00:06,  3.20it/s]
 90%|█████████ | 188/208 [01:55<00:06,  3.16it/s]
 91%|█████████ | 189/208 [01:55<00:05,  3.55it/s]
 91%|█████████▏| 190/208 [01:56<00:06,  2.64it/s]
 92%|█████████▏| 191/208 [01:57<00:09,  1.78it/s]
 92%|█████████▏| 192/208 [01:59<00:17,  1.07s/it]
 93%|█████████▎| 194/208 [02:00<00:09,  1.45it/s]
 94%|█████████▍| 196/208 [02:00<00:05,  2.21it/s]
 95%|█████████▍| 197/208 [02:00<00:04,  2.31it/s]
 95%|█████████▌| 198/208 [02:00<00:03,  2.74it/s]
 96%|█████████▌| 199/208 [02:01<00:02,  3.34it/s]
 97%|█████████▋| 201/208 [02:01<00:01,  4.38it/s]
 98%|█████████▊| 204/208 [02:01<00:00,  5.49it/s]
100%|█████████▉| 207/208 [02:01<00:00,  7.00it/s]
100%|██████████| 208/208 [02:02<00:00,  4.89it/s]
100%|██████████| 208/208 [02:02<00:00,  1.70it/s]